10/data/attachments/315ed8f8a28b4a3c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>soap_actions_74bf323d-e197-4daa-af3b-fd4e71150586</nif:username>
            <nif:friendToBeRequested>Douglas_leg_Actions_23107_8</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>